  <div class="row">
        <div class="col-lg-9">
            <h1>585.Investments in 2016</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Write a query to print the sum of all total investment values in 2016 (<b>TIV_2016</b>), to a scale of 2 decimal places, for all policy holders who meet the following criteria:</p>

<ol>
	<li>Have the same <b>TIV_2015</b> value as one or more other policyholders.</li>
	<li>Are not located in the same city as any other policyholder (i.e.: the (latitude, longitude) attribute pairs must be unique).</li>
</ol>

<p><b>Input Format:</b><br />
The <b><i>insurance</i></b> table is described as follows:</p>

<pre>
| Column Name | Type          |
|-------------|---------------|
| PID         | INTEGER(11)   |
| TIV_2015    | NUMERIC(15,2) |
| TIV_2016    | NUMERIC(15,2) |
| LAT         | NUMERIC(5,2)  |
| LON         | NUMERIC(5,2)  |
</pre>

<p>where <b>PID</b> is the policyholder&#39;s policy ID, <b>TIV_2015</b> is the total investment value in 2015, <b>TIV_2016</b> is the total investment value in 2016, <b>LAT</b> is the latitude of the policy holder&#39;s city, and <b>LON</b> is the longitude of the policy holder&#39;s city.</p>

<p><b>Sample Input</b></p>

<pre>
| PID | TIV_2015 | TIV_2016 | LAT | LON |
|-----|----------|----------|-----|-----|
| 1   | 10       | 5        | 10  | 10  |
| 2   | 20       | 20       | 20  | 20  |
| 3   | 10       | 30       | 20  | 20  |
| 4   | 10       | 40       | 40  | 40  |
</pre>

<p><b>Sample Output</b></p>

<pre>
| TIV_2016 |
|----------|
| 45.00    |
</pre>

<p><b>Explanation</b></p>

<pre>
The first record in the table, like the last record, meets both of the two criteria.
The <b>TIV_2015</b> value &#39;10&#39; is as the same as the third and forth record, and its location unique.

The second record does not meet any of the two criteria. Its <b>TIV_2015</b> is not like any other policyholders.

And its location is the same with the third record, which makes the third record fail, too.

So, the result is the sum of <b>TIV_2016</b> of the first and last record, which is 45.</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("insurance", engine)

   PID  TIV_2015  TIV_2016   LAT   LON
0    1      10.0       5.0  10.0  10.0
1    2      20.0      20.0  20.0  20.0
2    3      10.0      30.0  20.0  20.0
3    4      10.0      40.0  40.0  40.0

In [32]:
## Method 1: Subquery to form new dataset
query = '''
SELECT SUM(TIV_2016)
FROM (
SELECT ROUND(SUM(temp.TIV_2016),2) TIV_2016
FROM (SELECT SUM(i.TIV_2015) TIV_2015,
             SUM(i.TIV_2016) TIV_2016, 
             i.LAT, i.LON
      FROM insurance i
      GROUP BY i.LAT, i.LON
      HAVING COUNT(DISTINCT i.PID) = 1) temp
GROUP BY temp.TIV_2015 
HAVING COUNT(*) > 1) temp_out;
'''
pd.read_sql_query(query, engine)

   SUM(TIV_2016)
0           45.0

In [50]:
## Method 2: Subquery to form new dataset
query = '''
SELECT ROUND(SUM(temp.TIV_2016),2)
FROM(
SELECT i.PID, i.TIV_2016, 
       (SELECT COUNT(DISTINCT i2.PID)
        FROM insurance i2
        WHERE i.TIV_2015 = i2.TIV_2015) TIV_2015_times,
       (SELECT COUNT(DISTINCT i3.PID)
        FROM insurance i3
        WHERE (i.LAT, i.LON) = (i3.LAT, i3.LON)) LAT_LON_times
FROM insurance i) temp
WHERE temp.TIV_2015_times > 1 AND LAT_LON_times =1
;
'''
pd.read_sql_query(query, engine)

   ROUND(SUM(temp.TIV_2016),2)
0                         45.0

In [51]:
## Additional test
query = '''
SELECT ROUND(SUM(temp.TIV_2016),2)
FROM(
SELECT i.PID, i.TIV_2016, 
       (SELECT COUNT(DISTINCT i2.PID)
        FROM insurance1 i2
        WHERE i.TIV_2015 = i2.TIV_2015) TIV_2015_times,
       (SELECT COUNT(DISTINCT i3.PID)
        FROM insurance1 i3
        WHERE (i.LAT, i.LON) = (i3.LAT, i3.LON)) LAT_LON_times
FROM insurance1 i) temp
WHERE temp.TIV_2015_times > 1 AND LAT_LON_times =1
;
'''
pd.read_sql_query(query, engine)

   ROUND(SUM(temp.TIV_2016),2)
0                      4220.72